insert into subject(id, name, credit) values
(1, '기초공학설계', 2),
(2, '컴퓨터공학설계 및 실험1', 2),
(3, '컴퓨터공학설계 및 실험2', 2),
(4, '자료구조', 3),
(5, '프로그래밍언어', 3),
(6, '시스템프로그래밍', 3),
(7, '데이터베이스시스템', 3),
(8, '응용수학1', 3),
(9, '응용수학2', 3),
(10, '알바트로스세미나', 1),
(11, '인문학세미나', 1),
;

insert into teacher(id, name) values
(1, '장형수'),
(2, '김란희'),
(3, '김지환'),
(4, '김지은'),
(5, '이지현'),
(6, '남상희'),
(7, '원민지'),
(8, '김금주'),
(9, '김지환'),
(10, '정성원');

insert into class_room(id, name) values
(1, 'R912'),
(2, 'R914'),
(3, 'A114'),
(4, 'B914'),
(5, 'B014'),
(6, 'RB01'),
(7, 'AB02'),
(8, 'C204'),
(9, 'R204');

/*
insert into course (id, subject_id, teacher_id, class_room_id) values
(1, 1, 1, 1);
*/